yaxn/keil-pack-milandr/CMSIS_Driver/MDR1986VE1T/MDR1986VE1T_USART.c
      // Clear Send active flag
      usart->info->flags &= ~USART_FLAG_SEND_ACTIVE;
		
      return ARM_DRIVER_OK;
    // Abort receive
    case ARM_USART_ABORT_RECEIVE:
      // Disable receive interrupt
      usart->reg->IMSC &= ~(UART_IMSC_RXIM | UART_IMSC_FEIM |
					UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
			usart->reg->ICR |= (UART_ICR_RXIC | UART_ICR_FEIC |
					UART_ICR_PEIC | UART_ICR_BEIC | UART_ICR_OEIC);

      // Clear RX busy status
      usart->info->status.rx_busy = 0;
		
      return ARM_DRIVER_OK;
    // Abort transfer
    case ARM_USART_ABORT_TRANSFER:
      // Disable transmit and receive interrupts
			usart->reg->IMSC &= ~(UART_IMSC_RXIM | UART_IMSC_TXIM |
				UART_IMSC_FEIM | UART_IMSC_PEIM | UART_IMSC_BEIM | UART_IMSC_OEIM);
			usart->reg->ICR |= (UART_ICR_RXIC | UART_ICR_TXIC |
				UART_ICR_FEIC | UART_ICR_PEIC | UART_ICR_BEIC | UART_ICR_OEIC);

      // Clear busy statuses
      usart->info->status.rx_busy = 0;
      usart->info->flags &= ~USART_FLAG_SEND_ACTIVE;
		
      return ARM_DRIVER_OK;
  }

  switch (control & ARM_USART_CONTROL_Msk)
	{
    case ARM_USART_MODE_ASYNCHRONOUS:
      mode = ARM_USART_MODE_ASYNCHRONOUS;
		
      break;
    case ARM_USART_MODE_IRDA:
      if (usart->capabilities.irda)
        // Enable IrDA mode
				usart->reg->CR |= UART_CR_SIREN;
			else
				return ARM_USART_ERROR_MODE;
			
      mode = ARM_USART_MODE_IRDA;
			
      break;
    // IrDA pulse
    case ARM_USART_SET_IRDA_PULSE:
      if (usart->capabilities.irda)
				usart->reg->ILPR = RTE_HCLK / usart->clk.div / NomClkIrDA;
			else 
				return ARM_DRIVER_ERROR;
			
      return ARM_DRIVER_OK;
    // Unsupported command
    default:
			return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  // Check if Receiver/Transmitter is busy
  if (usart->info->status.rx_busy ||
		(usart->info->flags & USART_FLAG_SEND_ACTIVE))
			return ARM_DRIVER_ERROR_BUSY;

  // USART Data bits
  switch (control & ARM_USART_DATA_BITS_Msk)
	{
    case ARM_USART_DATA_BITS_5:
			usart->reg->LCR_H &= ~UART_LCR_H_WLEN_Msk;
			usart->reg->LCR_H |= (UART_LCR_H_WLEN_5_BITS << UART_LCR_H_WLEN_Pos);
		
			break;
    case ARM_USART_DATA_BITS_6:
			usart->reg->LCR_H &= ~UART_LCR_H_WLEN_Msk;
			usart->reg->LCR_H |= (UART_LCR_H_WLEN_6_BITS << UART_LCR_H_WLEN_Pos);
		
			break;
    case ARM_USART_DATA_BITS_7:
			usart->reg->LCR_H &= ~UART_LCR_H_WLEN_Msk;
			usart->reg->LCR_H |= (UART_LCR_H_WLEN_7_BITS << UART_LCR_H_WLEN_Pos);
		
			break;
    case ARM_USART_DATA_BITS_8:
			usart->reg->LCR_H &= ~UART_LCR_H_WLEN_Msk;
			usart->reg->LCR_H |= (UART_LCR_H_WLEN_8_BITS << UART_LCR_H_WLEN_Pos);
			
			break;
    default:
			return ARM_USART_ERROR_DATA_BITS;
  }

  // USART Parity
  switch (control & ARM_USART_PARITY_Msk)
	{
    case ARM_USART_PARITY_NONE:
			usart->reg->LCR_H &= ~UART_LCR_H_PEN;
			
			break;
    case ARM_USART_PARITY_EVEN:
			usart->reg->LCR_H |= UART_LCR_H_PEN;
			usart->reg->LCR_H &= ~UART_LCR_H_EPS;
			
			break;
    case ARM_USART_PARITY_ODD:
			usart->reg->LCR_H |= (UART_LCR_H_PEN | UART_LCR_H_EPS);
  }

  // USART Stop bits
  switch (control & ARM_USART_STOP_BITS_Msk)
	{
    case ARM_USART_STOP_BITS_1:
			usart->reg->LCR_H &= ~UART_LCR_H_STP2;
			
			break;
    case ARM_USART_STOP_BITS_2:
			usart->reg->LCR_H |= UART_LCR_H_STP2;
			
			break;
    default:
			return ARM_USART_ERROR_STOP_BITS;
  }

	usart->reg->CR &= ~(UART_CR_RTSEN | UART_CR_CTSEN);
		
  switch (control & ARM_USART_FLOW_CONTROL_Msk)
	{
		case ARM_USART_FLOW_CONTROL_NONE:
      break;
    case ARM_USART_FLOW_CONTROL_RTS:
      if (usart->capabilities.flow_control_rts)
        usart->reg->CR |= UART_CR_RTSEN;
      else
				return ARM_USART_ERROR_FLOW_CONTROL;
				
      break;
    case ARM_USART_FLOW_CONTROL_CTS:
      if (usart->capabilities.flow_control_cts)
        usart->reg->CR |= UART_CR_CTSEN;
      else
				return ARM_USART_ERROR_FLOW_CONTROL;
				
      break;
    case ARM_USART_FLOW_CONTROL_RTS_CTS:
      if (usart->capabilities.flow_control_rts &&
				usart->capabilities.flow_control_cts)
					usart->reg->CR |= (UART_CR_RTSEN | UART_CR_CTSEN);
			else
				return ARM_USART_ERROR_FLOW_CONTROL;
				
      break;
    default:
      return ARM_USART_ERROR_FLOW_CONTROL;
  }

  // USART Baudrate
  USART_SetBaudrate (arg, usart);

  // Configuration is OK - Mode is valid
  usart->info->mode = mode;

  // Set configured flag
  usart->info->flags |= USART_FLAG_CONFIGURED;

  return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART_GetStatus (USART_RESOURCES *usart)
{
	usart->info->status.tx_busy = (usart->reg->FR & UART_FR_TXFE ? (0) : (1));
	
  return usart->info->status;
}

static int32_t USART_SetModemControl (ARM_USART_MODEM_CONTROL control,
	USART_RESOURCES *usart)
{
	if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0)
    // USART is not configured
    return ARM_DRIVER_ERROR;
	
	if (control == ARM_USART_RTS_CLEAR)
	{
    if (usart->capabilities.rts)
			usart->reg->CR &= ~UART_CR_RTS;
    else
			return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
	
  if (control == ARM_USART_RTS_SET)
	{
    if (usart->capabilities.rts)
			usart->reg->CR |= UART_CR_RTS;
    else
			return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
	
  if (control == ARM_USART_DTR_CLEAR)
	{
    if (usart->capabilities.dtr)
			usart->reg->CR &= ~UART_CR_DTR;
    else
			return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
	
  if (control == ARM_USART_DTR_SET)
	{
    if (usart->capabilities.dtr)
			usart->reg->CR |= UART_CR_DTR;
    else
			return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
	
  return ARM_DRIVER_OK;
}

static ARM_USART_MODEM_STATUS USART_GetModemStatus (USART_RESOURCES *usart)
{
	ARM_USART_MODEM_STATUS modem_status;
  uint32_t fr;

  if (usart->info->flags & USART_FLAG_CONFIGURED)
	{
    fr = usart->reg->FR;

    if (usart->capabilities.cts)
			modem_status.cts = (fr & UART_FR_CTS ? (1) : (0));
    else
			modem_status.cts = 0;
		
    if (usart->capabilities.dsr)
			modem_status.dsr = (fr & UART_FR_DSR ? (1) : (0));
    else
			modem_status.dsr = 0;
		
    if (usart->capabilities.ri)
			modem_status.ri  = (fr & UART_FR_RI  ? (1) : (0));
    else
			modem_status.ri  = 0;
		
    if (usart->capabilities.dcd)
			modem_status.dcd = (fr & UART_FR_DCD ? (1) : (0));
    else
			modem_status.dcd = 0;
  }
	else
	{
		modem_status.cts = 0;
		modem_status.dsr = 0;
		modem_status.ri  = 0;
		modem_status.dcd = 0;
  }

  return modem_status;
}

